# SQL Analysis

This notebook connects to a SQLite database created from the sales dataset.
The objective is to answer business questions using SQL queries.

In [1]:
import sqlite3
import pandas as pd

In [2]:
# Connect to SQLite database
conn = sqlite3.connect("../data/sales.db")

## Database Structure

Checking available tables in the SQLite database.

In [3]:
pd.read_sql(
    "SELECT name FROM sqlite_master WHERE type='table';",
    conn
)

    name
0  sales

## Business Question 1  
What is the total revenue generated?

In [4]:
query = """
SELECT SUM(revenue) AS total_revenue
FROM sales
"""
pd.read_sql(query, conn)

   total_revenue
0           6850

## Business Question 2  
Which products generate the highest revenue?

In [5]:
query = """
SELECT product, SUM(revenue) AS total_revenue
FROM sales
GROUP BY product
ORDER BY total_revenue DESC
"""
pd.read_sql(query, conn)

  product  total_revenue
0       A           3400
1       B           2640
2       C            810

## Business Question 3  
How does revenue vary by region?

In [6]:
query = """
SELECT region, SUM(revenue) AS total_revenue
FROM sales
GROUP BY region
ORDER BY total_revenue DESC
"""
pd.read_sql(query, conn)

  region  total_revenue
0  North           2800
1   West           2040
2  South           1380
3   East            630

In [ ]:
conn.close()